"""
Каждое n-значное число, которое содержит каждую цифру от 1 до n ровно один раз,
будем считать пан-цифровым; к примеру, 5-значное число 15234 является
пан-цифровым, т.к. содержит цифры от 1 до 5.

Произведение 7254 является необычным, поскольку равенство 39 × 186 = 7254,
состоящее из множимого, множителя и произведения является пан-цифровым, т.е.
содержит цифры от 1 до 9.

Найдите сумму всех пан-цифровых произведений, для которых равенство
"множимое × множитель = произведение" можно записать цифрами от 1 до 9,
используя каждую цифру только один раз.

ПОДСКАЗКА: Некоторые произведения можно получить несколькими способами,
поэтому убедитесь, что включили их в сумму лишь единожды.
"""
from itertools import permutations

res = set()
for pan in permutations('123456789'):
    pan = ''.join(pan)
    for first in range(1, 5):
        for second in range(first+1, first + 3):
            if pan == pan[:first] + pan[first:second] + str(int(pan[:first]) * int(pan[first:second])):
                res.add(int(pan[:first]) * int(pan[first:second]))

print(sum(res))
