# n! означает n × (n − 1) × ... × 3 × 2 × 1
#
# Например, 10! = 10 × 9 × ... × 3 × 2 × 1 = 3628800,
# и сумма цифр в числе 10! равна 3 + 6 + 2 + 8 + 8 + 0 + 0 = 27.
#
# Найдите сумму цифр в числе 100!.
fac = 1
n = 100
answer = 0
while n:
    fac *= n
    n -= 1
*fac, = str(fac)

for i in fac:
    answer += int(i)

print(answer)
