"""
Сумма 1^1 + 2^2 + 3^3 + ... + 10^10 = 10405071317.
Найдите последние десять цифр суммы 11 + 22 + 33 + ... + 10001000.
"""
print(str(sum((num ** num for num in range(1, 1001))))[-10:])
